{"0": {"task": "Dear Mr. Brown,\nThank you for your email regarding the project proposal. I appreciate the feedback you provided, and I will make the necessary ajustments as soon as possible. Please let me know if there are any additional changes you would like me to include. I aim to deliver a revised version by the end of the week. Your input is invaluable in improving the final draft. Thank you again for your guidance.\nBest regards,\nEmily Carter", "answers": {"A": {"text": "adjustments", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "1": {"task": "Reading is not just a hobby; it’s a way to open new doors to knowledge and ideas. Studies have shown that reading frequently can enhance cognitive function and even delay the onset of demntia. Moreover, it expands your vocabulary and helps you articulate your thoughts more effectively. Whether it’s fiction, non-fiction, or poetry, books allow you to explore different perspectives and develop a deeper understanding of the world. Take time to read every day! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "2": {"task": "Hi team,\nI was wondering if we could schedule a quick meeting tomorrow to discuss the upcoming presentation. There are a few points that need clarification, especially regarding the target audiance. I believe it would help us align our goals and ensure we deliver an impactful presentation. Let me know your availability for a 30-minute discussion. Thanks for your cooperation, and I’m confident we’ll achieve great results together!\nBest,\nTom ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "3": {"task": "Volunteer Opportunity: Animal Shelter Help Needed\nAre you an animal lover? The city shelter is seeking volunteers to assist with daily tasks such as feeding, cleaning, and spending time with the animals. This is a chance to make a real differnce in the lives of abandoned pets. Volunteers are needed on weekdays from 10 AM to 4 PM. Training will be provided, so no prior experience is necessary. Contact us at info@shelter.com to sign up. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "4": {"task": "Hey everyone! Have you heard about the new restaurant in town? It’s called The Culinary Spot, and they offer an amazing range of dishes from different cuisines. I tried their signature pasta dish last night, and it was absolutly delicious. The service was fantastic, and the atmosphere was warm and inviting. If you’re a foodie looking for something new, I highly recommend checking it out. Let me know if you’ve been there already! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "5": {"task": "Dear Students,\nThis is a gentle reminder that the deadline for submitting your essays is this Friday at 5 PM. Late submissions will not be accepted, so please ensure you upload your work to the portal on time. If you encounter any technical difficutlies, contact the IT department immediately. Remember, your essay is worth 40% of your final grade, so take this opportunity to showcase your best work. Good luck!\nBest regards,\nMs. Harper ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "6": {"task": "Would you like to improve your fitness level while having fun? Joining a group fitness class might be just what you need! Classes like yoga, Zumba, or spinning provide not only a great workout but also a chance to meet new people. Studies suggest that exercising in a group setting can boost motivation and consistency. Don’t wait for the perfect moment; start your fitness journey today and build a healthier you with each step forward.. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "7": {"task": "Hi Mike,\nI hope you’re doing well! I wanted to check if you’re still available to help with the community event this weekend. We’re expecting around 100 attendees, and I could use an extra hand setting up the decorations and organizing the raffle prizes. Let me know what time you’re free, and I’ll make sure we have everything ready. Thanks in advance for your suport!\nTake care,\nLiam ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "8": {"task": "Lost Item: Silver Bracelet\nI lost my silver bracelet last Saturday while shopping in the city center. It has a small charm with the letter “A” engraved on it. This bracelet holds great sentimental value to me, so I would really appreciate it if someone returns it. If found, please contact me at 555-678-910 or email me at anna.brown@email.com. There is a small reward for its safe return. Thank you for keeping an eye out for it! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "9": {"task": "Planning your dream holiday can feel overwhelming, but it’s also an exciting experience. Start by choosing a destination that suits your interests, whether it’s a relaxing beach or a cultural city tour. Then, create an itinerary that balances sightseeing with time to rest. Don’t forget to book your accomodation and activities in advance to avoid last-minute stress. With some careful planning, your next holiday will be a wonderful adventure full of unforgettable memories. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "10": {"task": "Invitation to Workshop: Creative Writing Basics\nAre you interested in improving your writing skills? Join our Creative Writing Basics workshop next Saturday from 10 AM to 3 PM at the community center. This workshop is open to beginners and covers topics like character development, storytelling, and editing. Bring a notebook and pen, and get ready to unleash your creativity. Spaces are limited, so reserve your spot today! Don’t miss this exciting opportinity to learn and grow as a writer. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "11": {"task": "Hi Alex,\nI just wanted to share a quick update about the group project. I’ve finished the introduction and added a few points to the conclusion. Could you please review the second section? It still needs more examples to support our arguments. Let me know if you have time to work on it this evening. Together, we can finalize everything before the deadline. Thanks for your cooperation and hard work! Talk to you soon. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "12": {"task": "Do you love exploring nature? Hiking might be the perfect hobby for you! It’s a great way to stay active, enjoy fresh air, and experience beautiful landscapes. Before you head out, make sure to plan your route and pack essentials like water, snacks, and a map. Comfortable shoes are a must! Whether you’re a beginner or an experienced hiker, there’s always something new to discover. Embrace the adventure and enjoy every step along the trail. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "13": {"task": "Job Opportunity: Part-Time Barista\nLooking for a job? Our café is hiring a part-time barista! If you’re friendly, reliable, and enjoy working in a team, we’d love to hear from you. Previous experience is a plus but not required, as training will be provided. Duties include making coffee, serving customers, and keeping the café tidy. Please apply in person or send your CV to careers@cozycafe.com. Join our team and become part of a fun and dynamic enviroment! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "14": {"task": "Dear Participants,\nThank you for attending yesterday’s webinar on time management. We hope you found the session informative and helpful. As promised, we’ve attached the slides and resources discussed during the presentation. If you have any questions or feedback, feel free to reach out. Remember, effective time management is a skill that takes practice, so start small and build from there. We wish you success in achieving your goals! Have a productive day ahead. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "15": {"task": "Dear Book Enthusiast,\nWe are excited to invite you to join our monthly book club, where literature lovers gather to discuss various genres and authors. Our next meeting is scheduled for March 15th at 6 PM in the community center. This month, we will delve into contemporary fiction, focusing on character development and narrative techniques. Please confirm your attendance by March 10th. We look forward to sharing insightful conversations and fostering a love for reading together.\nBest regards,\nThe Reading Circle ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "16": {"task": "Dear Team,\nWe are pleased to announce a workshop on time management strategies to enhance our productivity and efficiency. The session will cover prioritization, delegation, and effective scheduling techniques. It is scheduled for April 5th from 2 PM to 4 PM in the main conference room. Kindly RSVP by March 30th to ensure your participation. Let’s work together to make the most of our time and achieve our goals more effectively.\nBest,\nManagement ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "17": {"task": "Dear Residents,\nAs part of our ongoing efforts to maintain a clean and healthy environment, we are organizing a community clean-up event on April 10th. Volunteers will meet at the park entrance at 9 AM. Gloves, bags, and refreshments will be provided. Your participation will make a significant difference in keeping our neighborhood beautiful and sustainable. Let’s come together to show our community spirit and commitment to the environment.\nSincerely,\nGreen Earth Initiative ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "18": {"task": "Dear Employees,\nThis is a friendly reminder to schedule your annual health check-up, as part of our company’s wellness program. Regular health screenings are essential for early detection and prevention of potential health issues. Please contact the HR department to arrange an appointment at your earliest convenience. Taking proactive steps towards your health ensures a healthier and more productive work life.\nBest regards,\nHuman Resources ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "19": {"task": "Dear Colleagues,\nWe are delighted to invite you to a seminar on cultural diversity and inclusion in the workplace. The seminar aims to promote understanding and respect among team members from diverse backgrounds. It will be held on May 20th at 10 AM in the auditorium. Please confirm your attendance by May 15th. Embracing diversity enriches our work environment and drives innovation. We look forward to your participation.\nWarm regards,\nDiversity and Inclusion Committee ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}}