{"0": {"task": "The children ran out to the road and climbed into\nthe bus. Fern took no notice of the others in the bus.\nShe just sat and stared out of the window, thinking\nwhat a blisful world it was and how lucky she was to\nhave entire charge of a pig. By the time the bus reached\nschool, F em had named her pet, selecting the most\nbeautiful name she could think of.", "answers": {"A": {"text": "blissful", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "1": {"task": "Every morning after breakfast, Wilbur walked out\nto the road with Fern and waited with her till the bus\ncame. She would wave good-bye to him, and he would\nstand and watch the bus until it vanished around a\nturn. While Fern was in school, Wilbur was shut up\ninside his yard. But as soon as she got home in the\nafternoon, she would take him out and he would\nfollow her around the place. If she went into the\nhouse, Wilbur went, too. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "2": {"task": "If she took her doll for a walk in the doll carriage,\nWilbur followed along. Sometimes, on these\njurneys (journeys), Wilbur would get tired, and Fern would pick\nhim up and put him in the carriage alongside the doll.\nHe liked this. And if he was very tired, he would close\nhis eyes and go to sleep under the doll's blanket. He\nlooked cute when his eyes were closed, because his\nlashes were so long. The doll would close her eyes, too,\nand Fern would wheel the carriage very slowly and\nsmoothly so as not to wake her infants. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "3": {"task": "It was soon arranged. Fern phoned and got her\nAunt Edith, and her Aunt Edith hollered for Uncle\nHomer, and Uncle Homer came in from the bam and\ntalked to Fern. When he heard that the price was only\nsix dollars, he said he would buy the pig. Next day\nWilbur was taken from his home under the apple tree\nand went to live in a manure pile in the cellar of Zuckerman's\nBam. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "4": {"task": "\"There's never anything to do around here,\" he\nthought. He walked slowly to his food trough and\nsniffed to see if anything had been overlooked at\nlunch. He found a small strip of potato skin and ate it.\nHis back itched, so he leaned against the fence and\nrubed (rubbed) against the boards. When he tired of this, he\nwalked indoors, climbed to the top of the manure pile,\nand sat down. He didn't feel like going to sleep, he\ndidn't feel like digging, he was tired of standing still,\ntired of lying down. \"I'm less than two months old and\nI'm tired of living,\" he said. He walked out to the yard\nAgain. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "5": {"task": "Subject: Confirmation of Your Appointment\nDear Anna,\nThank you for booking an appointment with us. We have scheduled your visit for Tuesday, January 23rd, at 3:00 PM. Please arrive 10 minutes early to complete any necessary paperwork. If you need to reschedole (reschedule), let us know 24 hours in advance.\nWe look forward to seeing you.\nBest regards,\nThe Green Clinic ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "6": {"task": "Eating healthy doesn’t have to be difficult. Start by adding more fruits and vegetables to your meals. Try to drink plenty of water and avoid sugary drinks. Cooking at home is a great way to control what you eat. Remember, small changes make a big diference (difference) over time. Healthy eating can give you more energy and help you feel better every day. ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "7": {"task": "Hi Sarah,\nI hope you’re doing well! Would you like to go to the cinema this Friday evening? There’s a new comedy film showing at 7 PM, and I heard it’s really funny. We could grab some snacks or even have dinner before the movie starts. It would be great to catch up and spend some time together. Let me know if you’re free, so I can book the tickets in advance. Looking forward to hearing from you!\nTake care,\nEmma ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "8": {"task": "Lost Phone\nI lost my phone in the city center yesterday afternoon, near the main square. It’s a black Samsung Galaxy with a red case. The phone has some important personal information on it, and I really need it back. If you find it, please call me on (at) 555-123-456 or email me at john.doe@email.com. There is a reward for its return. Your help would mean a lot to me. Thank you for keeping an eye out! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "9": {"task": "What are your plans for the weekend? I’m thinking of visiting the new park in town. It’s such a beautiful place with gardens, a small lake, and even a café where we can enjoy some coffee or tea. I heard the wether (weather)  will be perfect for a walk and some fresh air. If anyone wants to join me, let me know! It’s always more fun to explore new places with friends. Let’s make it a great weekend! 😊 ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "10": {"task": "Dear Mr. Brown,\nI hope this email finds you well. I recently aplied  for the Marketing Assistant position at your company and wanted to follow up regarding the status of my application. I am very excited about the opportunity to contribute to your team and bring value with my skills. Please let me know if you need any additional information from me. Thank you for your time and consideration.\nBest regards,\nEmily Carter", "answers": {"A": {"text": "applied", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "11": {"task": "Reading is a great way to improve your knowledge and relax at the same time. It helps you learn new things, expand your vocabulary, and improve your writing skills. Reading also reduces stress and boosts your creativity. You can chose from different genres, such as mystery, romance, or science fiction. Whether you prefer books, magazines, or online articles, spending just ", "answers": {"A": {"text": "choose", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "12": {"task": "Hi everyone,\nI hope you’re all doing well! I was thinking it might be helpful to organize a study group for the upcoming math test. We could meet at the library on Saturday around 10 AM. Everyone could bring their notes and questions, and we can help each other understand the topics better. Studying together makes it more fun and effective! Let me know if you’re interested or if another time work (works) better.\nCheers,\nTom ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "13": {"task": "Join Our Community Cleanup Day!\nLet’s make our neighborhood cleaner and greener! We are organizing a community cleanup event on Saturday, January 27th, from 9 AM to 12 PM. Volunteers will meet at the park entrance. Gloves, bags, and tools will be provided. This is a great opportunity to meet neighbors and make a positive impact on the environment. Bring your friends and family, and let’s work together to keep our area beautiful! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}, "14": {"task": "Hey everyone! I just discovered a new café downtown, and I have to tell you about it. It’s called Cozy Corner, and it has the best coffee and pastries I’ve had in a long time. The atmosphere is so warm and welcom (welcoming), with soft music and comfy chairs. They also have free Wi-Fi, so it’s perfect for studying or working. If you’re looking for a nice place to relax, you should definitely check it out! ", "answers": {"A": {"text": "", "correct": true}, "B": {"text": "incorrect", "correct": false}}, "explanation": ""}}